Revit 2027 API
ConfigurationReloadInfo Methods
The ConfigurationReloadInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetConnectivityValidation |  Returns information about the post-reload connectivity validation.
GetCustomDataChangedElements |  Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOutOfDatePartStatus |  Access reload information for out of date part.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace